#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
/* automatically generated by rust-bindgen 0.69.4 */

pub const NV_MAX_DEVICES: u32 = 32;
pub const NV_MAX_SUBDEVICES: u32 = 8;
pub const NV_PROC_NAME_MAX_LENGTH: u32 = 100;
pub const NV_MAX_HEADS: u32 = 4;
pub const NV_UUID_LEN: u32 = 16;
pub const UVM_MAX_GPUS_V1: u32 = 32;
pub const UVM_MAX_PROCESSORS_V1: u32 = 33;
pub const UVM_MAX_GPUS_V2: u32 = 256;
pub const UVM_MAX_PROCESSORS_V2: u32 = 257;
pub const UVM_MAX_GPUS: u32 = 32;
pub const UVM_MAX_PROCESSORS: u32 = 33;
pub const UVM_DEBUG_V1: u32 = 1;
pub const UVM_COUNTER_NAME_FLAG_BYTES_XFER_HTD: u32 = 1;
pub const UVM_COUNTER_NAME_FLAG_BYTES_XFER_DTH: u32 = 2;
pub const UVM_COUNTER_NAME_FLAG_CPU_PAGE_FAULT_COUNT: u32 = 4;
pub const UVM_COUNTER_NAME_FLAG_WDDM_BYTES_XFER_BTH: u32 = 8;
pub const UVM_COUNTER_NAME_FLAG_WDDM_BYTES_XFER_HTB: u32 = 16;
pub const UVM_COUNTER_NAME_FLAG_BYTES_XFER_DTB: u32 = 32;
pub const UVM_COUNTER_NAME_FLAG_BYTES_XFER_BTD: u32 = 64;
pub const UVM_COUNTER_NAME_FLAG_PREFETCH_BYTES_XFER_HTD: u32 = 128;
pub const UVM_COUNTER_NAME_FLAG_PREFETCH_BYTES_XFER_DTH: u32 = 256;
pub const UVM_COUNTER_NAME_FLAG_GPU_PAGE_FAULT_COUNT: u32 = 512;
pub const UVM_COUNTER_CONFIG_STATE_DISABLE_REQUESTED: u32 = 0;
pub const UVM_COUNTER_CONFIG_STATE_ENABLE_REQUESTED: u32 = 1;
pub const UVM_DEBUG_ACCESS_PAGE_SIZE: u32 = 4096;
pub type UInt64 = ::std::os::raw::c_ulonglong;
pub type Int64 = ::std::os::raw::c_longlong;
pub type UInt32 = ::std::os::raw::c_uint;
pub type Int32 = ::std::os::raw::c_int;
pub type UInt16 = ::std::os::raw::c_ushort;
pub type Int16 = ::std::os::raw::c_short;
pub type UInt8 = ::std::os::raw::c_uchar;
pub type Int8 = ::std::os::raw::c_schar;
pub type Void = ::std::os::raw::c_void;
pub type float32_t = f32;
pub type float64_t = f64;
pub type NvV8 = ::std::os::raw::c_uchar;
pub type NvU8 = ::std::os::raw::c_uchar;
pub type NvS8 = ::std::os::raw::c_schar;
pub type NvV16 = u16;
pub type NvU16 = u16;
pub type NvS16 = i16;
pub type NvV32 = u32;
pub type NvU32 = u32;
pub type NvS32 = i32;
pub type NvU64 = u64;
pub type NvS64 = i64;
pub type NvP64 = *mut ::std::os::raw::c_void;
pub type NvUPtr = NvU64;
pub type NvSPtr = NvS64;
pub type NvLength = NvU64;
pub type NvHandle = NvU32;
pub type NV_STATUS = NvU32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nv_uuid {
    pub uuid: [NvU8; 16usize],
}
#[test]
fn bindgen_test_layout_nv_uuid() {
    const UNINIT: ::std::mem::MaybeUninit<nv_uuid> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<nv_uuid>(),
        16usize,
        concat!("Size of: ", stringify!(nv_uuid))
    );
    assert_eq!(
        ::std::mem::align_of::<nv_uuid>(),
        1usize,
        concat!("Alignment of ", stringify!(nv_uuid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uuid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nv_uuid),
            "::",
            stringify!(uuid)
        )
    );
}
pub type NvUuid = nv_uuid;
pub type NvSystemUuid = NvUuid;
pub type NvProcessorUuid = NvUuid;
extern "C" {
    pub static NV_PROCESSOR_UUID_CPU_DEFAULT: NvProcessorUuid;
}
pub const UvmStreamType_UvmStreamTypeRegular: UvmStreamType = 0;
pub const UvmStreamType_UvmStreamTypeAll: UvmStreamType = 1;
pub const UvmStreamType_UvmStreamTypeNone: UvmStreamType = 2;
#[doc = "UVM stream types"]
pub type UvmStreamType = ::std::os::raw::c_uint;
pub type UvmStream = ::std::os::raw::c_ulonglong;
pub const UvmGpuMappingType_UvmGpuMappingTypeDefault: UvmGpuMappingType = 0;
pub const UvmGpuMappingType_UvmGpuMappingTypeReadWriteAtomic: UvmGpuMappingType = 1;
pub const UvmGpuMappingType_UvmGpuMappingTypeReadWrite: UvmGpuMappingType = 2;
pub const UvmGpuMappingType_UvmGpuMappingTypeReadOnly: UvmGpuMappingType = 3;
pub const UvmGpuMappingType_UvmGpuMappingTypeCount: UvmGpuMappingType = 4;
pub type UvmGpuMappingType = ::std::os::raw::c_uint;
pub const UvmGpuCachingType_UvmGpuCachingTypeDefault: UvmGpuCachingType = 0;
pub const UvmGpuCachingType_UvmGpuCachingTypeForceUncached: UvmGpuCachingType = 1;
pub const UvmGpuCachingType_UvmGpuCachingTypeForceCached: UvmGpuCachingType = 2;
pub const UvmGpuCachingType_UvmGpuCachingTypeCount: UvmGpuCachingType = 3;
pub type UvmGpuCachingType = ::std::os::raw::c_uint;
pub const UvmGpuFormatType_UvmGpuFormatTypeDefault: UvmGpuFormatType = 0;
pub const UvmGpuFormatType_UvmGpuFormatTypeBlockLinear: UvmGpuFormatType = 1;
pub const UvmGpuFormatType_UvmGpuFormatTypeCount: UvmGpuFormatType = 2;
pub type UvmGpuFormatType = ::std::os::raw::c_uint;
pub const UvmGpuFormatElementBits_UvmGpuFormatElementBitsDefault: UvmGpuFormatElementBits = 0;
pub const UvmGpuFormatElementBits_UvmGpuFormatElementBits8: UvmGpuFormatElementBits = 1;
pub const UvmGpuFormatElementBits_UvmGpuFormatElementBits16: UvmGpuFormatElementBits = 2;
pub const UvmGpuFormatElementBits_UvmGpuFormatElementBits32: UvmGpuFormatElementBits = 4;
pub const UvmGpuFormatElementBits_UvmGpuFormatElementBits64: UvmGpuFormatElementBits = 5;
pub const UvmGpuFormatElementBits_UvmGpuFormatElementBits128: UvmGpuFormatElementBits = 6;
pub const UvmGpuFormatElementBits_UvmGpuFormatElementBitsCount: UvmGpuFormatElementBits = 7;
pub type UvmGpuFormatElementBits = ::std::os::raw::c_uint;
pub const UvmGpuCompressionType_UvmGpuCompressionTypeDefault: UvmGpuCompressionType = 0;
pub const UvmGpuCompressionType_UvmGpuCompressionTypeEnabledNoPlc: UvmGpuCompressionType = 1;
pub const UvmGpuCompressionType_UvmGpuCompressionTypeCount: UvmGpuCompressionType = 2;
pub type UvmGpuCompressionType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmGpuMappingAttributes {
    pub gpuUuid: NvProcessorUuid,
    pub gpuMappingType: NvU32,
    pub gpuCachingType: NvU32,
    pub gpuFormatType: NvU32,
    pub gpuElementBits: NvU32,
    pub gpuCompressionType: NvU32,
}
#[test]
fn bindgen_test_layout_UvmGpuMappingAttributes() {
    const UNINIT: ::std::mem::MaybeUninit<UvmGpuMappingAttributes> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmGpuMappingAttributes>(),
        36usize,
        concat!("Size of: ", stringify!(UvmGpuMappingAttributes))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmGpuMappingAttributes>(),
        4usize,
        concat!("Alignment of ", stringify!(UvmGpuMappingAttributes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuUuid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuMappingAttributes),
            "::",
            stringify!(gpuUuid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuMappingType) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuMappingAttributes),
            "::",
            stringify!(gpuMappingType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuCachingType) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuMappingAttributes),
            "::",
            stringify!(gpuCachingType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuFormatType) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuMappingAttributes),
            "::",
            stringify!(gpuFormatType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuElementBits) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuMappingAttributes),
            "::",
            stringify!(gpuElementBits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuCompressionType) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuMappingAttributes),
            "::",
            stringify!(gpuCompressionType)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmGlobalState_tag {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union UvmGpuPlatformParams {
    pub rm_linux: UvmGpuPlatformParams__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmGpuPlatformParams__bindgen_ty_1 {
    pub ctrlFd: ::std::os::raw::c_int,
    pub hClient: NvHandle,
    pub hSmcPartRef: NvHandle,
}
#[test]
fn bindgen_test_layout_UvmGpuPlatformParams__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmGpuPlatformParams__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmGpuPlatformParams__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(UvmGpuPlatformParams__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmGpuPlatformParams__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(UvmGpuPlatformParams__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrlFd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuPlatformParams__bindgen_ty_1),
            "::",
            stringify!(ctrlFd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hClient) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuPlatformParams__bindgen_ty_1),
            "::",
            stringify!(hClient)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hSmcPartRef) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuPlatformParams__bindgen_ty_1),
            "::",
            stringify!(hSmcPartRef)
        )
    );
}
#[test]
fn bindgen_test_layout_UvmGpuPlatformParams() {
    const UNINIT: ::std::mem::MaybeUninit<UvmGpuPlatformParams> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmGpuPlatformParams>(),
        12usize,
        concat!("Size of: ", stringify!(UvmGpuPlatformParams))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmGpuPlatformParams>(),
        4usize,
        concat!("Alignment of ", stringify!(UvmGpuPlatformParams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_linux) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuPlatformParams),
            "::",
            stringify!(rm_linux)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union UvmGpuVaSpacePlatformParams {
    pub rm_linux: UvmGpuVaSpacePlatformParams__bindgen_ty_1,
    pub rm_windows: UvmGpuVaSpacePlatformParams__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmGpuVaSpacePlatformParams__bindgen_ty_1 {
    pub ctrlFd: ::std::os::raw::c_int,
    pub hClient: NvHandle,
    pub hVaSpace: NvHandle,
}
#[test]
fn bindgen_test_layout_UvmGpuVaSpacePlatformParams__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmGpuVaSpacePlatformParams__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmGpuVaSpacePlatformParams__bindgen_ty_1>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(UvmGpuVaSpacePlatformParams__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<UvmGpuVaSpacePlatformParams__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(UvmGpuVaSpacePlatformParams__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrlFd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuVaSpacePlatformParams__bindgen_ty_1),
            "::",
            stringify!(ctrlFd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hClient) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuVaSpacePlatformParams__bindgen_ty_1),
            "::",
            stringify!(hClient)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hVaSpace) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuVaSpacePlatformParams__bindgen_ty_1),
            "::",
            stringify!(hVaSpace)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmGpuVaSpacePlatformParams__bindgen_ty_2 {
    pub hClient: NvHandle,
    pub hVaSpace: NvHandle,
}
#[test]
fn bindgen_test_layout_UvmGpuVaSpacePlatformParams__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmGpuVaSpacePlatformParams__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmGpuVaSpacePlatformParams__bindgen_ty_2>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(UvmGpuVaSpacePlatformParams__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<UvmGpuVaSpacePlatformParams__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(UvmGpuVaSpacePlatformParams__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hClient) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuVaSpacePlatformParams__bindgen_ty_2),
            "::",
            stringify!(hClient)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hVaSpace) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuVaSpacePlatformParams__bindgen_ty_2),
            "::",
            stringify!(hVaSpace)
        )
    );
}
#[test]
fn bindgen_test_layout_UvmGpuVaSpacePlatformParams() {
    const UNINIT: ::std::mem::MaybeUninit<UvmGpuVaSpacePlatformParams> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmGpuVaSpacePlatformParams>(),
        12usize,
        concat!("Size of: ", stringify!(UvmGpuVaSpacePlatformParams))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmGpuVaSpacePlatformParams>(),
        4usize,
        concat!("Alignment of ", stringify!(UvmGpuVaSpacePlatformParams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_linux) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuVaSpacePlatformParams),
            "::",
            stringify!(rm_linux)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_windows) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmGpuVaSpacePlatformParams),
            "::",
            stringify!(rm_windows)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union UvmChannelPlatformParams {
    pub rm_linux: UvmChannelPlatformParams__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmChannelPlatformParams__bindgen_ty_1 {
    pub ctrlFd: ::std::os::raw::c_int,
    pub hClient: NvHandle,
    pub hChannel: NvHandle,
}
#[test]
fn bindgen_test_layout_UvmChannelPlatformParams__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmChannelPlatformParams__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmChannelPlatformParams__bindgen_ty_1>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(UvmChannelPlatformParams__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<UvmChannelPlatformParams__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(UvmChannelPlatformParams__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrlFd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmChannelPlatformParams__bindgen_ty_1),
            "::",
            stringify!(ctrlFd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hClient) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmChannelPlatformParams__bindgen_ty_1),
            "::",
            stringify!(hClient)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hChannel) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmChannelPlatformParams__bindgen_ty_1),
            "::",
            stringify!(hChannel)
        )
    );
}
#[test]
fn bindgen_test_layout_UvmChannelPlatformParams() {
    const UNINIT: ::std::mem::MaybeUninit<UvmChannelPlatformParams> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmChannelPlatformParams>(),
        12usize,
        concat!("Size of: ", stringify!(UvmChannelPlatformParams))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmChannelPlatformParams>(),
        4usize,
        concat!("Alignment of ", stringify!(UvmChannelPlatformParams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_linux) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmChannelPlatformParams),
            "::",
            stringify!(rm_linux)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union UvmAllocationPlatformParams {
    pub rm_linux: UvmAllocationPlatformParams__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmAllocationPlatformParams__bindgen_ty_1 {
    pub ctrlFd: ::std::os::raw::c_int,
    pub hClient: NvHandle,
    pub hMemory: NvHandle,
}
#[test]
fn bindgen_test_layout_UvmAllocationPlatformParams__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmAllocationPlatformParams__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmAllocationPlatformParams__bindgen_ty_1>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(UvmAllocationPlatformParams__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<UvmAllocationPlatformParams__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(UvmAllocationPlatformParams__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrlFd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmAllocationPlatformParams__bindgen_ty_1),
            "::",
            stringify!(ctrlFd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hClient) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmAllocationPlatformParams__bindgen_ty_1),
            "::",
            stringify!(hClient)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hMemory) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmAllocationPlatformParams__bindgen_ty_1),
            "::",
            stringify!(hMemory)
        )
    );
}
#[test]
fn bindgen_test_layout_UvmAllocationPlatformParams() {
    const UNINIT: ::std::mem::MaybeUninit<UvmAllocationPlatformParams> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmAllocationPlatformParams>(),
        12usize,
        concat!("Size of: ", stringify!(UvmAllocationPlatformParams))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmAllocationPlatformParams>(),
        4usize,
        concat!("Alignment of ", stringify!(UvmAllocationPlatformParams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rm_linux) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmAllocationPlatformParams),
            "::",
            stringify!(rm_linux)
        )
    );
}
pub type UvmDebugSession = NvUPtr;
pub const UvmCounterScope_UvmCounterScopeProcessSingleGpu: UvmCounterScope = 0;
pub const UvmCounterScope_UvmCounterScopeProcessAllGpu: UvmCounterScope = 1;
pub const UvmCounterScope_UvmCounterScopeGlobalSingleGpu: UvmCounterScope = 2;
pub const UvmCounterScope_UvmCounterScopeSize: UvmCounterScope = 3;
pub type UvmCounterScope = ::std::os::raw::c_uint;
pub const UvmCounterName_UvmCounterNameBytesXferHtD: UvmCounterName = 0;
pub const UvmCounterName_UvmCounterNameBytesXferDtH: UvmCounterName = 1;
pub const UvmCounterName_UvmCounterNameCpuPageFaultCount: UvmCounterName = 2;
pub const UvmCounterName_UvmCounterNamePrefetchBytesXferHtD: UvmCounterName = 7;
pub const UvmCounterName_UvmCounterNamePrefetchBytesXferDtH: UvmCounterName = 8;
pub const UvmCounterName_UvmCounterNameGpuPageFaultCount: UvmCounterName = 9;
pub const UvmCounterName_UVM_TOTAL_COUNTERS: UvmCounterName = 10;
pub type UvmCounterName = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmCounterConfig {
    pub scope: NvU32,
    pub name: NvU32,
    pub gpuid: NvProcessorUuid,
    pub state: NvU32,
}
#[test]
fn bindgen_test_layout_UvmCounterConfig() {
    const UNINIT: ::std::mem::MaybeUninit<UvmCounterConfig> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmCounterConfig>(),
        28usize,
        concat!("Size of: ", stringify!(UvmCounterConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmCounterConfig>(),
        4usize,
        concat!("Alignment of ", stringify!(UvmCounterConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scope) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmCounterConfig),
            "::",
            stringify!(scope)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmCounterConfig),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmCounterConfig),
            "::",
            stringify!(gpuid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmCounterConfig),
            "::",
            stringify!(state)
        )
    );
}
pub const UvmEventMemoryAccessType_UvmEventMemoryAccessTypeInvalid: UvmEventMemoryAccessType = 0;
pub const UvmEventMemoryAccessType_UvmEventMemoryAccessTypeRead: UvmEventMemoryAccessType = 1;
pub const UvmEventMemoryAccessType_UvmEventMemoryAccessTypeWrite: UvmEventMemoryAccessType = 2;
pub const UvmEventMemoryAccessType_UvmEventMemoryAccessTypeAtomic: UvmEventMemoryAccessType = 3;
pub const UvmEventMemoryAccessType_UvmEventMemoryAccessTypePrefetch: UvmEventMemoryAccessType = 4;
pub const UvmEventMemoryAccessType_UvmEventNumMemoryAccessTypes: UvmEventMemoryAccessType = 5;
pub type UvmEventMemoryAccessType = ::std::os::raw::c_uint;
pub const UvmEventType_UvmEventTypeInvalid: UvmEventType = 0;
pub const UvmEventType_UvmEventTypeMemoryViolation: UvmEventType = 1;
pub const UvmEventType_UvmEventTypeCpuFault: UvmEventType = 1;
pub const UvmEventType_UvmEventTypeMigration: UvmEventType = 2;
pub const UvmEventType_UvmEventTypeGpuFault: UvmEventType = 3;
pub const UvmEventType_UvmEventTypeGpuFaultReplay: UvmEventType = 4;
pub const UvmEventType_UvmEventTypeFaultBufferOverflow: UvmEventType = 5;
pub const UvmEventType_UvmEventTypeFatalFault: UvmEventType = 6;
pub const UvmEventType_UvmEventTypeReadDuplicate: UvmEventType = 7;
pub const UvmEventType_UvmEventTypeReadDuplicateInvalidate: UvmEventType = 8;
pub const UvmEventType_UvmEventTypePageSizeChange: UvmEventType = 9;
pub const UvmEventType_UvmEventTypeThrashingDetected: UvmEventType = 10;
pub const UvmEventType_UvmEventTypeThrottlingStart: UvmEventType = 11;
pub const UvmEventType_UvmEventTypeThrottlingEnd: UvmEventType = 12;
pub const UvmEventType_UvmEventTypeMapRemote: UvmEventType = 13;
pub const UvmEventType_UvmEventTypeEviction: UvmEventType = 14;
pub const UvmEventType_UvmEventNumTypes: UvmEventType = 15;
pub const UvmEventType_UvmEventTestTypesFirst: UvmEventType = 62;
pub const UvmEventType_UvmEventTypeTestHmmSplitInvalidate: UvmEventType = 62;
pub const UvmEventType_UvmEventTypeTestAccessCounter: UvmEventType = 63;
pub const UvmEventType_UvmEventTestTypesLast: UvmEventType = 63;
pub const UvmEventType_UvmEventNumTypesAll: UvmEventType = 64;
pub type UvmEventType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventCpuFaultInfo_V1 {
    pub eventType: NvU8,
    pub accessType: NvU8,
    pub padding16Bits: NvU16,
    pub padding32Bits: NvU32,
    pub address: NvU64,
    pub timeStamp: NvU64,
    pub pid: NvU32,
    pub threadId: NvU32,
    pub pc: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventCpuFaultInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventCpuFaultInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventCpuFaultInfo_V1>(),
        40usize,
        concat!("Size of: ", stringify!(UvmEventCpuFaultInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventCpuFaultInfo_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventCpuFaultInfo_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accessType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V1),
            "::",
            stringify!(accessType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16Bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V1),
            "::",
            stringify!(padding16Bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32Bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V1),
            "::",
            stringify!(padding32Bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V1),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V1),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pid) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V1),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).threadId) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V1),
            "::",
            stringify!(threadId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pc) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V1),
            "::",
            stringify!(pc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventCpuFaultInfo_V2 {
    pub eventType: NvU8,
    pub accessType: NvU8,
    pub padding16Bits: NvU16,
    pub nid: NvS32,
    pub address: NvU64,
    pub timeStamp: NvU64,
    pub pid: NvU32,
    pub threadId: NvU32,
    pub pc: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventCpuFaultInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventCpuFaultInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventCpuFaultInfo_V2>(),
        40usize,
        concat!("Size of: ", stringify!(UvmEventCpuFaultInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventCpuFaultInfo_V2>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventCpuFaultInfo_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accessType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V2),
            "::",
            stringify!(accessType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16Bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V2),
            "::",
            stringify!(padding16Bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V2),
            "::",
            stringify!(nid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V2),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V2),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pid) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V2),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).threadId) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V2),
            "::",
            stringify!(threadId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pc) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventCpuFaultInfo_V2),
            "::",
            stringify!(pc)
        )
    );
}
pub const UvmEventMigrationDirection_UvmEventMigrationDirectionInvalid: UvmEventMigrationDirection =
    0;
pub const UvmEventMigrationDirection_UvmEventMigrationDirectionCpuToGpu:
    UvmEventMigrationDirection = 1;
pub const UvmEventMigrationDirection_UvmEventMigrationDirectionGpuToCpu:
    UvmEventMigrationDirection = 2;
pub const UvmEventMigrationDirection_UvmEventNumMigrationDirections: UvmEventMigrationDirection = 3;
pub type UvmEventMigrationDirection = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventMigrationInfo_Lite {
    pub eventType: NvU8,
    pub direction: NvU8,
    pub srcIndex: NvU8,
    pub dstIndex: NvU8,
    pub padding32Bits: NvU32,
    pub address: NvU64,
    pub migratedBytes: NvU64,
    pub beginTimeStamp: NvU64,
    pub endTimeStamp: NvU64,
    pub streamId: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventMigrationInfo_Lite() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventMigrationInfo_Lite> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventMigrationInfo_Lite>(),
        48usize,
        concat!("Size of: ", stringify!(UvmEventMigrationInfo_Lite))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventMigrationInfo_Lite>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventMigrationInfo_Lite))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_Lite),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).direction) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_Lite),
            "::",
            stringify!(direction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srcIndex) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_Lite),
            "::",
            stringify!(srcIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dstIndex) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_Lite),
            "::",
            stringify!(dstIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32Bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_Lite),
            "::",
            stringify!(padding32Bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_Lite),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).migratedBytes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_Lite),
            "::",
            stringify!(migratedBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).beginTimeStamp) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_Lite),
            "::",
            stringify!(beginTimeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endTimeStamp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_Lite),
            "::",
            stringify!(endTimeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).streamId) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_Lite),
            "::",
            stringify!(streamId)
        )
    );
}
pub const UvmEventFaultType_UvmFaultTypeInvalid: UvmEventFaultType = 0;
pub const UvmEventFaultType_UvmFaultTypeInvalidPde: UvmEventFaultType = 1;
pub const UvmEventFaultType_UvmFaultTypeInvalidPte: UvmEventFaultType = 2;
pub const UvmEventFaultType_UvmFaultTypeWrite: UvmEventFaultType = 3;
pub const UvmEventFaultType_UvmFaultTypeAtomic: UvmEventFaultType = 4;
pub const UvmEventFaultType_UvmFaultTypeFatal: UvmEventFaultType = 5;
pub const UvmEventFaultType_UvmFaultTypeInvalidPdeSize: UvmEventFaultType = 5;
pub const UvmEventFaultType_UvmFaultTypeLimitViolation: UvmEventFaultType = 6;
pub const UvmEventFaultType_UvmFaultTypeUnboundInstBlock: UvmEventFaultType = 7;
pub const UvmEventFaultType_UvmFaultTypePrivViolation: UvmEventFaultType = 8;
pub const UvmEventFaultType_UvmFaultTypePitchMaskViolation: UvmEventFaultType = 9;
pub const UvmEventFaultType_UvmFaultTypeWorkCreation: UvmEventFaultType = 10;
pub const UvmEventFaultType_UvmFaultTypeUnsupportedAperture: UvmEventFaultType = 11;
pub const UvmEventFaultType_UvmFaultTypeCompressionFailure: UvmEventFaultType = 12;
pub const UvmEventFaultType_UvmFaultTypeUnsupportedKind: UvmEventFaultType = 13;
pub const UvmEventFaultType_UvmFaultTypeRegionViolation: UvmEventFaultType = 14;
pub const UvmEventFaultType_UvmFaultTypePoison: UvmEventFaultType = 15;
pub const UvmEventFaultType_UvmEventNumFaultTypes: UvmEventFaultType = 16;
pub type UvmEventFaultType = ::std::os::raw::c_uint;
pub const UvmEventFatalReason_UvmEventFatalReasonInvalid: UvmEventFatalReason = 0;
pub const UvmEventFatalReason_UvmEventFatalReasonInvalidAddress: UvmEventFatalReason = 1;
pub const UvmEventFatalReason_UvmEventFatalReasonInvalidPermissions: UvmEventFatalReason = 2;
pub const UvmEventFatalReason_UvmEventFatalReasonInvalidFaultType: UvmEventFatalReason = 3;
pub const UvmEventFatalReason_UvmEventFatalReasonOutOfMemory: UvmEventFatalReason = 4;
pub const UvmEventFatalReason_UvmEventFatalReasonInternalError: UvmEventFatalReason = 5;
pub const UvmEventFatalReason_UvmEventFatalReasonInvalidOperation: UvmEventFatalReason = 6;
pub const UvmEventFatalReason_UvmEventNumFatalReasons: UvmEventFatalReason = 7;
pub type UvmEventFatalReason = ::std::os::raw::c_uint;
pub const UvmEventMigrationCause_UvmEventMigrationCauseInvalid: UvmEventMigrationCause = 0;
pub const UvmEventMigrationCause_UvmEventMigrationCauseUser: UvmEventMigrationCause = 1;
pub const UvmEventMigrationCause_UvmEventMigrationCauseCoherence: UvmEventMigrationCause = 2;
pub const UvmEventMigrationCause_UvmEventMigrationCausePrefetch: UvmEventMigrationCause = 3;
pub const UvmEventMigrationCause_UvmEventMigrationCauseEviction: UvmEventMigrationCause = 4;
pub const UvmEventMigrationCause_UvmEventMigrationCauseAccessCounters: UvmEventMigrationCause = 5;
pub const UvmEventMigrationCause_UvmEventNumMigrationCauses: UvmEventMigrationCause = 6;
pub type UvmEventMigrationCause = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventMigrationInfo_V1 {
    pub eventType: NvU8,
    pub migrationCause: NvU8,
    pub srcIndex: NvU8,
    pub dstIndex: NvU8,
    pub padding32Bits: NvU32,
    pub address: NvU64,
    pub migratedBytes: NvU64,
    pub beginTimeStamp: NvU64,
    pub endTimeStamp: NvU64,
    pub rangeGroupId: NvU64,
    pub beginTimeStampGpu: NvU64,
    pub endTimeStampGpu: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventMigrationInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventMigrationInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventMigrationInfo_V1>(),
        64usize,
        concat!("Size of: ", stringify!(UvmEventMigrationInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventMigrationInfo_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventMigrationInfo_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).migrationCause) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V1),
            "::",
            stringify!(migrationCause)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srcIndex) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V1),
            "::",
            stringify!(srcIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dstIndex) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V1),
            "::",
            stringify!(dstIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32Bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V1),
            "::",
            stringify!(padding32Bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V1),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).migratedBytes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V1),
            "::",
            stringify!(migratedBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).beginTimeStamp) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V1),
            "::",
            stringify!(beginTimeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endTimeStamp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V1),
            "::",
            stringify!(endTimeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rangeGroupId) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V1),
            "::",
            stringify!(rangeGroupId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).beginTimeStampGpu) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V1),
            "::",
            stringify!(beginTimeStampGpu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endTimeStampGpu) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V1),
            "::",
            stringify!(endTimeStampGpu)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventMigrationInfo_V2 {
    pub eventType: NvU8,
    pub migrationCause: NvU8,
    pub padding16Bits: NvU16,
    pub srcIndex: NvU16,
    pub dstIndex: NvU16,
    pub srcNid: NvS32,
    pub dstNid: NvS32,
    pub address: NvU64,
    pub migratedBytes: NvU64,
    pub beginTimeStamp: NvU64,
    pub endTimeStamp: NvU64,
    pub rangeGroupId: NvU64,
    pub beginTimeStampGpu: NvU64,
    pub endTimeStampGpu: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventMigrationInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventMigrationInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventMigrationInfo_V2>(),
        72usize,
        concat!("Size of: ", stringify!(UvmEventMigrationInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventMigrationInfo_V2>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventMigrationInfo_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).migrationCause) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(migrationCause)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16Bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(padding16Bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srcIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(srcIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dstIndex) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(dstIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srcNid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(srcNid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dstNid) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(dstNid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).migratedBytes) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(migratedBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).beginTimeStamp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(beginTimeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endTimeStamp) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(endTimeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rangeGroupId) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(rangeGroupId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).beginTimeStampGpu) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(beginTimeStampGpu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endTimeStampGpu) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMigrationInfo_V2),
            "::",
            stringify!(endTimeStampGpu)
        )
    );
}
pub const UvmEventFaultClientType_UvmEventFaultClientTypeInvalid: UvmEventFaultClientType = 0;
pub const UvmEventFaultClientType_UvmEventFaultClientTypeGpc: UvmEventFaultClientType = 1;
pub const UvmEventFaultClientType_UvmEventFaultClientTypeHub: UvmEventFaultClientType = 2;
pub const UvmEventFaultClientType_UvmEventNumFaultClientTypes: UvmEventFaultClientType = 3;
pub type UvmEventFaultClientType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct UvmEventGpuFaultInfo_V1 {
    pub eventType: NvU8,
    pub faultType: NvU8,
    pub accessType: NvU8,
    pub gpuIndex: NvU8,
    pub __bindgen_anon_1: UvmEventGpuFaultInfo_V1__bindgen_ty_1,
    pub clientId: NvU16,
    pub address: NvU64,
    pub timeStamp: NvU64,
    pub timeStampGpu: NvU64,
    pub batchId: NvU32,
    pub clientType: NvU8,
    pub padding8Bits: NvU8,
    pub padding16Bits: NvU16,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union UvmEventGpuFaultInfo_V1__bindgen_ty_1 {
    pub gpcId: NvU16,
    pub channelId: NvU16,
}
#[test]
fn bindgen_test_layout_UvmEventGpuFaultInfo_V1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventGpuFaultInfo_V1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventGpuFaultInfo_V1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(UvmEventGpuFaultInfo_V1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventGpuFaultInfo_V1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(UvmEventGpuFaultInfo_V1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpcId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1__bindgen_ty_1),
            "::",
            stringify!(gpcId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1__bindgen_ty_1),
            "::",
            stringify!(channelId)
        )
    );
}
#[test]
fn bindgen_test_layout_UvmEventGpuFaultInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventGpuFaultInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventGpuFaultInfo_V1>(),
        40usize,
        concat!("Size of: ", stringify!(UvmEventGpuFaultInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventGpuFaultInfo_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventGpuFaultInfo_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).faultType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1),
            "::",
            stringify!(faultType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accessType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1),
            "::",
            stringify!(accessType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuIndex) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1),
            "::",
            stringify!(gpuIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientId) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1),
            "::",
            stringify!(clientId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStampGpu) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1),
            "::",
            stringify!(timeStampGpu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).batchId) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1),
            "::",
            stringify!(batchId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientType) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1),
            "::",
            stringify!(clientType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8Bits) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1),
            "::",
            stringify!(padding8Bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16Bits) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V1),
            "::",
            stringify!(padding16Bits)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct UvmEventGpuFaultInfo_V2 {
    pub eventType: NvU8,
    pub faultType: NvU8,
    pub accessType: NvU8,
    pub padding8Bits_1: NvU8,
    pub __bindgen_anon_1: UvmEventGpuFaultInfo_V2__bindgen_ty_1,
    pub clientId: NvU16,
    pub address: NvU64,
    pub timeStamp: NvU64,
    pub timeStampGpu: NvU64,
    pub batchId: NvU32,
    pub clientType: NvU8,
    pub padding8Bits_2: NvU8,
    pub gpuIndex: NvU16,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union UvmEventGpuFaultInfo_V2__bindgen_ty_1 {
    pub gpcId: NvU16,
    pub channelId: NvU16,
}
#[test]
fn bindgen_test_layout_UvmEventGpuFaultInfo_V2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventGpuFaultInfo_V2__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventGpuFaultInfo_V2__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(UvmEventGpuFaultInfo_V2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventGpuFaultInfo_V2__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(UvmEventGpuFaultInfo_V2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpcId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2__bindgen_ty_1),
            "::",
            stringify!(gpcId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2__bindgen_ty_1),
            "::",
            stringify!(channelId)
        )
    );
}
#[test]
fn bindgen_test_layout_UvmEventGpuFaultInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventGpuFaultInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventGpuFaultInfo_V2>(),
        40usize,
        concat!("Size of: ", stringify!(UvmEventGpuFaultInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventGpuFaultInfo_V2>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventGpuFaultInfo_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).faultType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2),
            "::",
            stringify!(faultType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accessType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2),
            "::",
            stringify!(accessType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8Bits_1) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2),
            "::",
            stringify!(padding8Bits_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientId) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2),
            "::",
            stringify!(clientId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStampGpu) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2),
            "::",
            stringify!(timeStampGpu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).batchId) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2),
            "::",
            stringify!(batchId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientType) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2),
            "::",
            stringify!(clientType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8Bits_2) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2),
            "::",
            stringify!(padding8Bits_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuIndex) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultInfo_V2),
            "::",
            stringify!(gpuIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventGpuFaultReplayInfo_V1 {
    pub eventType: NvU8,
    pub gpuIndex: NvU8,
    pub clientType: NvU8,
    pub padding8bits: NvU8,
    pub batchId: NvU32,
    pub timeStamp: NvU64,
    pub timeStampGpu: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventGpuFaultReplayInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventGpuFaultReplayInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventGpuFaultReplayInfo_V1>(),
        24usize,
        concat!("Size of: ", stringify!(UvmEventGpuFaultReplayInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventGpuFaultReplayInfo_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventGpuFaultReplayInfo_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuIndex) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V1),
            "::",
            stringify!(gpuIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V1),
            "::",
            stringify!(clientType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V1),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).batchId) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V1),
            "::",
            stringify!(batchId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V1),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStampGpu) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V1),
            "::",
            stringify!(timeStampGpu)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventGpuFaultReplayInfo_V2 {
    pub eventType: NvU8,
    pub clientType: NvU8,
    pub gpuIndex: NvU16,
    pub batchId: NvU32,
    pub timeStamp: NvU64,
    pub timeStampGpu: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventGpuFaultReplayInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventGpuFaultReplayInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventGpuFaultReplayInfo_V2>(),
        24usize,
        concat!("Size of: ", stringify!(UvmEventGpuFaultReplayInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventGpuFaultReplayInfo_V2>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventGpuFaultReplayInfo_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V2),
            "::",
            stringify!(clientType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuIndex) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V2),
            "::",
            stringify!(gpuIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).batchId) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V2),
            "::",
            stringify!(batchId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V2),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStampGpu) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventGpuFaultReplayInfo_V2),
            "::",
            stringify!(timeStampGpu)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventFatalFaultInfo_V1 {
    pub eventType: NvU8,
    pub faultType: NvU8,
    pub accessType: NvU8,
    pub processorIndex: NvU8,
    pub reason: NvU8,
    pub padding8bits: NvU8,
    pub padding16bits: NvU16,
    pub address: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventFatalFaultInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventFatalFaultInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventFatalFaultInfo_V1>(),
        24usize,
        concat!("Size of: ", stringify!(UvmEventFatalFaultInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventFatalFaultInfo_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventFatalFaultInfo_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).faultType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V1),
            "::",
            stringify!(faultType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accessType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V1),
            "::",
            stringify!(accessType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processorIndex) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V1),
            "::",
            stringify!(processorIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reason) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V1),
            "::",
            stringify!(reason)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V1),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V1),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V1),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V1),
            "::",
            stringify!(timeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventFatalFaultInfo_V2 {
    pub eventType: NvU8,
    pub faultType: NvU8,
    pub accessType: NvU8,
    pub reason: NvU8,
    pub processorIndex: NvU16,
    pub padding16bits: NvU16,
    pub address: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventFatalFaultInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventFatalFaultInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventFatalFaultInfo_V2>(),
        24usize,
        concat!("Size of: ", stringify!(UvmEventFatalFaultInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventFatalFaultInfo_V2>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventFatalFaultInfo_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).faultType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V2),
            "::",
            stringify!(faultType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accessType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V2),
            "::",
            stringify!(accessType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reason) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V2),
            "::",
            stringify!(reason)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processorIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V2),
            "::",
            stringify!(processorIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V2),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V2),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventFatalFaultInfo_V2),
            "::",
            stringify!(timeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventReadDuplicateInfo_V1 {
    pub eventType: NvU8,
    pub padding8bits: NvU8,
    pub padding16bits: NvU16,
    pub padding32bits: NvU32,
    pub processors: NvU64,
    pub address: NvU64,
    pub size: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventReadDuplicateInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventReadDuplicateInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventReadDuplicateInfo_V1>(),
        40usize,
        concat!("Size of: ", stringify!(UvmEventReadDuplicateInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventReadDuplicateInfo_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventReadDuplicateInfo_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V1),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V1),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V1),
            "::",
            stringify!(padding32bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processors) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V1),
            "::",
            stringify!(processors)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V1),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V1),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V1),
            "::",
            stringify!(timeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventReadDuplicateInfo_V2 {
    pub eventType: NvU8,
    pub padding8bits: NvU8,
    pub padding16bits: NvU16,
    pub padding32bits: NvU32,
    pub address: NvU64,
    pub size: NvU64,
    pub timeStamp: NvU64,
    pub processors: [NvU64; 5usize],
}
#[test]
fn bindgen_test_layout_UvmEventReadDuplicateInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventReadDuplicateInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventReadDuplicateInfo_V2>(),
        72usize,
        concat!("Size of: ", stringify!(UvmEventReadDuplicateInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventReadDuplicateInfo_V2>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventReadDuplicateInfo_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V2),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V2),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V2),
            "::",
            stringify!(padding32bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V2),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V2),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V2),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processors) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInfo_V2),
            "::",
            stringify!(processors)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventReadDuplicateInvalidateInfo_V1 {
    pub eventType: NvU8,
    pub residentIndex: NvU8,
    pub padding16bits: NvU16,
    pub padding32bits: NvU32,
    pub address: NvU64,
    pub size: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventReadDuplicateInvalidateInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventReadDuplicateInvalidateInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventReadDuplicateInvalidateInfo_V1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventReadDuplicateInvalidateInfo_V1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).residentIndex) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V1),
            "::",
            stringify!(residentIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V1),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V1),
            "::",
            stringify!(padding32bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V1),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V1),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V1),
            "::",
            stringify!(timeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventReadDuplicateInvalidateInfo_V2 {
    pub eventType: NvU8,
    pub padding8bits: NvU8,
    pub residentIndex: NvU16,
    pub padding32bits: NvU32,
    pub address: NvU64,
    pub size: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventReadDuplicateInvalidateInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventReadDuplicateInvalidateInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventReadDuplicateInvalidateInfo_V2>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventReadDuplicateInvalidateInfo_V2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V2),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).residentIndex) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V2),
            "::",
            stringify!(residentIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V2),
            "::",
            stringify!(padding32bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V2),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V2),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventReadDuplicateInvalidateInfo_V2),
            "::",
            stringify!(timeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventPageSizeChangeInfo_V1 {
    pub eventType: NvU8,
    pub processorIndex: NvU8,
    pub padding16bits: NvU16,
    pub size: NvU32,
    pub address: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventPageSizeChangeInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventPageSizeChangeInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventPageSizeChangeInfo_V1>(),
        24usize,
        concat!("Size of: ", stringify!(UvmEventPageSizeChangeInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventPageSizeChangeInfo_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventPageSizeChangeInfo_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventPageSizeChangeInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processorIndex) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventPageSizeChangeInfo_V1),
            "::",
            stringify!(processorIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventPageSizeChangeInfo_V1),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventPageSizeChangeInfo_V1),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventPageSizeChangeInfo_V1),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventPageSizeChangeInfo_V1),
            "::",
            stringify!(timeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventPageSizeChangeInfo_V2 {
    pub eventType: NvU8,
    pub padding8bits: NvU8,
    pub processorIndex: NvU16,
    pub size: NvU32,
    pub address: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventPageSizeChangeInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventPageSizeChangeInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventPageSizeChangeInfo_V2>(),
        24usize,
        concat!("Size of: ", stringify!(UvmEventPageSizeChangeInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventPageSizeChangeInfo_V2>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventPageSizeChangeInfo_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventPageSizeChangeInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventPageSizeChangeInfo_V2),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processorIndex) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventPageSizeChangeInfo_V2),
            "::",
            stringify!(processorIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventPageSizeChangeInfo_V2),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventPageSizeChangeInfo_V2),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventPageSizeChangeInfo_V2),
            "::",
            stringify!(timeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventThrashingDetectedInfo_V1 {
    pub eventType: NvU8,
    pub padding8bits: NvU8,
    pub padding16bits: NvU16,
    pub padding32bits: NvU32,
    pub processors: NvU64,
    pub address: NvU64,
    pub size: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventThrashingDetectedInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventThrashingDetectedInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventThrashingDetectedInfo_V1>(),
        40usize,
        concat!("Size of: ", stringify!(UvmEventThrashingDetectedInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventThrashingDetectedInfo_V1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(UvmEventThrashingDetectedInfo_V1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V1),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V1),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V1),
            "::",
            stringify!(padding32bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processors) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V1),
            "::",
            stringify!(processors)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V1),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V1),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V1),
            "::",
            stringify!(timeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventThrashingDetectedInfo_V2 {
    pub eventType: NvU8,
    pub padding8bits: NvU8,
    pub padding16bits: NvU16,
    pub padding32bits: NvU32,
    pub address: NvU64,
    pub size: NvU64,
    pub timeStamp: NvU64,
    pub processors: [NvU64; 5usize],
}
#[test]
fn bindgen_test_layout_UvmEventThrashingDetectedInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventThrashingDetectedInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventThrashingDetectedInfo_V2>(),
        72usize,
        concat!("Size of: ", stringify!(UvmEventThrashingDetectedInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventThrashingDetectedInfo_V2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(UvmEventThrashingDetectedInfo_V2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V2),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V2),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V2),
            "::",
            stringify!(padding32bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V2),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V2),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V2),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processors) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrashingDetectedInfo_V2),
            "::",
            stringify!(processors)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventThrottlingStartInfo_V1 {
    pub eventType: NvU8,
    pub processorIndex: NvU8,
    pub padding16bits: NvU16,
    pub padding32bits: NvU32,
    pub address: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventThrottlingStartInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventThrottlingStartInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventThrottlingStartInfo_V1>(),
        24usize,
        concat!("Size of: ", stringify!(UvmEventThrottlingStartInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventThrottlingStartInfo_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventThrottlingStartInfo_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingStartInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processorIndex) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingStartInfo_V1),
            "::",
            stringify!(processorIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingStartInfo_V1),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingStartInfo_V1),
            "::",
            stringify!(padding32bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingStartInfo_V1),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingStartInfo_V1),
            "::",
            stringify!(timeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventThrottlingStartInfo_V2 {
    pub eventType: NvU8,
    pub padding8bits: NvU8,
    pub padding16bits: [NvU16; 2usize],
    pub processorIndex: NvU16,
    pub address: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventThrottlingStartInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventThrottlingStartInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventThrottlingStartInfo_V2>(),
        24usize,
        concat!("Size of: ", stringify!(UvmEventThrottlingStartInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventThrottlingStartInfo_V2>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventThrottlingStartInfo_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingStartInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingStartInfo_V2),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingStartInfo_V2),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processorIndex) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingStartInfo_V2),
            "::",
            stringify!(processorIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingStartInfo_V2),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingStartInfo_V2),
            "::",
            stringify!(timeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventThrottlingEndInfo_V1 {
    pub eventType: NvU8,
    pub processorIndex: NvU8,
    pub padding16bits: NvU16,
    pub padding32bits: NvU32,
    pub address: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventThrottlingEndInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventThrottlingEndInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventThrottlingEndInfo_V1>(),
        24usize,
        concat!("Size of: ", stringify!(UvmEventThrottlingEndInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventThrottlingEndInfo_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventThrottlingEndInfo_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingEndInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processorIndex) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingEndInfo_V1),
            "::",
            stringify!(processorIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingEndInfo_V1),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingEndInfo_V1),
            "::",
            stringify!(padding32bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingEndInfo_V1),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingEndInfo_V1),
            "::",
            stringify!(timeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventThrottlingEndInfo_V2 {
    pub eventType: NvU8,
    pub padding8bits: NvU8,
    pub padding16bits: [NvU16; 2usize],
    pub processorIndex: NvU16,
    pub address: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventThrottlingEndInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventThrottlingEndInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventThrottlingEndInfo_V2>(),
        24usize,
        concat!("Size of: ", stringify!(UvmEventThrottlingEndInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventThrottlingEndInfo_V2>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventThrottlingEndInfo_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingEndInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingEndInfo_V2),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingEndInfo_V2),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processorIndex) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingEndInfo_V2),
            "::",
            stringify!(processorIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingEndInfo_V2),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventThrottlingEndInfo_V2),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub const UvmEventMapRemoteCause_UvmEventMapRemoteCauseInvalid: UvmEventMapRemoteCause = 0;
pub const UvmEventMapRemoteCause_UvmEventMapRemoteCauseCoherence: UvmEventMapRemoteCause = 1;
pub const UvmEventMapRemoteCause_UvmEventMapRemoteCauseThrashing: UvmEventMapRemoteCause = 2;
pub const UvmEventMapRemoteCause_UvmEventMapRemoteCausePolicy: UvmEventMapRemoteCause = 3;
pub const UvmEventMapRemoteCause_UvmEventMapRemoteCauseOutOfMemory: UvmEventMapRemoteCause = 4;
pub const UvmEventMapRemoteCause_UvmEventMapRemoteCauseEviction: UvmEventMapRemoteCause = 5;
pub type UvmEventMapRemoteCause = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventMapRemoteInfo_V1 {
    pub eventType: NvU8,
    pub srcIndex: NvU8,
    pub dstIndex: NvU8,
    pub mapRemoteCause: NvU8,
    pub padding32bits: NvU32,
    pub address: NvU64,
    pub size: NvU64,
    pub timeStamp: NvU64,
    pub timeStampGpu: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventMapRemoteInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventMapRemoteInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventMapRemoteInfo_V1>(),
        40usize,
        concat!("Size of: ", stringify!(UvmEventMapRemoteInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventMapRemoteInfo_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventMapRemoteInfo_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srcIndex) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V1),
            "::",
            stringify!(srcIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dstIndex) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V1),
            "::",
            stringify!(dstIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapRemoteCause) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V1),
            "::",
            stringify!(mapRemoteCause)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V1),
            "::",
            stringify!(padding32bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V1),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V1),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V1),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStampGpu) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V1),
            "::",
            stringify!(timeStampGpu)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventMapRemoteInfo_V2 {
    pub eventType: NvU8,
    pub mapRemoteCause: NvU8,
    pub padding16bits: NvU16,
    pub srcIndex: NvU16,
    pub dstIndex: NvU16,
    pub address: NvU64,
    pub size: NvU64,
    pub timeStamp: NvU64,
    pub timeStampGpu: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventMapRemoteInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventMapRemoteInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventMapRemoteInfo_V2>(),
        40usize,
        concat!("Size of: ", stringify!(UvmEventMapRemoteInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventMapRemoteInfo_V2>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventMapRemoteInfo_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapRemoteCause) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V2),
            "::",
            stringify!(mapRemoteCause)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V2),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srcIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V2),
            "::",
            stringify!(srcIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dstIndex) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V2),
            "::",
            stringify!(dstIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V2),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V2),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V2),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStampGpu) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventMapRemoteInfo_V2),
            "::",
            stringify!(timeStampGpu)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventEvictionInfo_V1 {
    pub eventType: NvU8,
    pub srcIndex: NvU8,
    pub dstIndex: NvU8,
    pub padding8bits: NvU8,
    pub padding32bits: NvU32,
    pub addressOut: NvU64,
    pub addressIn: NvU64,
    pub size: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventEvictionInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventEvictionInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventEvictionInfo_V1>(),
        40usize,
        concat!("Size of: ", stringify!(UvmEventEvictionInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventEvictionInfo_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventEvictionInfo_V1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srcIndex) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V1),
            "::",
            stringify!(srcIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dstIndex) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V1),
            "::",
            stringify!(dstIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V1),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32bits) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V1),
            "::",
            stringify!(padding32bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addressOut) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V1),
            "::",
            stringify!(addressOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addressIn) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V1),
            "::",
            stringify!(addressIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V1),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V1),
            "::",
            stringify!(timeStamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventEvictionInfo_V2 {
    pub eventType: NvU8,
    pub padding8bits: NvU8,
    pub padding16bits: NvU16,
    pub srcIndex: NvU16,
    pub dstIndex: NvU16,
    pub addressOut: NvU64,
    pub addressIn: NvU64,
    pub size: NvU64,
    pub timeStamp: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventEvictionInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventEvictionInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventEvictionInfo_V2>(),
        40usize,
        concat!("Size of: ", stringify!(UvmEventEvictionInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventEvictionInfo_V2>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventEvictionInfo_V2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V2),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V2),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srcIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V2),
            "::",
            stringify!(srcIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dstIndex) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V2),
            "::",
            stringify!(dstIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addressOut) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V2),
            "::",
            stringify!(addressOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addressIn) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V2),
            "::",
            stringify!(addressIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V2),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEvictionInfo_V2),
            "::",
            stringify!(timeStamp)
        )
    );
}
pub const UvmEventApertureType_UvmEventAperturePeer0: UvmEventApertureType = 1;
pub const UvmEventApertureType_UvmEventAperturePeer1: UvmEventApertureType = 2;
pub const UvmEventApertureType_UvmEventAperturePeer2: UvmEventApertureType = 3;
pub const UvmEventApertureType_UvmEventAperturePeer3: UvmEventApertureType = 4;
pub const UvmEventApertureType_UvmEventAperturePeer4: UvmEventApertureType = 5;
pub const UvmEventApertureType_UvmEventAperturePeer5: UvmEventApertureType = 6;
pub const UvmEventApertureType_UvmEventAperturePeer6: UvmEventApertureType = 7;
pub const UvmEventApertureType_UvmEventAperturePeer7: UvmEventApertureType = 8;
pub const UvmEventApertureType_UvmEventAperturePeerMax: UvmEventApertureType = 8;
pub const UvmEventApertureType_UvmEventApertureSys: UvmEventApertureType = 9;
pub const UvmEventApertureType_UvmEventApertureVid: UvmEventApertureType = 10;
pub type UvmEventApertureType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventTestAccessCounterInfo_V1 {
    pub eventType: NvU8,
    pub srcIndex: NvU8,
    pub aperture: NvU8,
    pub instancePtrAperture: NvU8,
    pub isVirtual: NvU8,
    pub isFromCpu: NvU8,
    pub veId: NvU8,
    pub physOnManaged: NvU8,
    pub value: NvU32,
    pub subGranularity: NvU32,
    pub tag: NvU32,
    pub bank: NvU32,
    pub address: NvU64,
    pub instancePtr: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventTestAccessCounterInfo_V1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventTestAccessCounterInfo_V1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventTestAccessCounterInfo_V1>(),
        40usize,
        concat!("Size of: ", stringify!(UvmEventTestAccessCounterInfo_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventTestAccessCounterInfo_V1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(UvmEventTestAccessCounterInfo_V1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srcIndex) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(srcIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aperture) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(aperture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).instancePtrAperture) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(instancePtrAperture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isVirtual) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(isVirtual)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isFromCpu) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(isFromCpu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).veId) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(veId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).physOnManaged) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(physOnManaged)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subGranularity) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(subGranularity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bank) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(bank)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).instancePtr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V1),
            "::",
            stringify!(instancePtr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventTestAccessCounterInfo_V2 {
    pub eventType: NvU8,
    pub aperture: NvU8,
    pub instancePtrAperture: NvU8,
    pub isVirtual: NvU8,
    pub isFromCpu: NvU8,
    pub veId: NvU8,
    pub physOnManaged: NvU8,
    pub padding8bits: NvU8,
    pub srcIndex: NvU16,
    pub padding16bits: NvU16,
    pub value: NvU32,
    pub subGranularity: NvU32,
    pub tag: NvU32,
    pub bank: NvU32,
    pub padding32bits: NvU32,
    pub address: NvU64,
    pub instancePtr: NvU64,
}
#[test]
fn bindgen_test_layout_UvmEventTestAccessCounterInfo_V2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventTestAccessCounterInfo_V2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventTestAccessCounterInfo_V2>(),
        48usize,
        concat!("Size of: ", stringify!(UvmEventTestAccessCounterInfo_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventTestAccessCounterInfo_V2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(UvmEventTestAccessCounterInfo_V2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aperture) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(aperture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).instancePtrAperture) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(instancePtrAperture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isVirtual) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(isVirtual)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isFromCpu) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(isFromCpu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).veId) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(veId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).physOnManaged) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(physOnManaged)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding8bits) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(padding8bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srcIndex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(srcIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding16bits) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(padding16bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subGranularity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(subGranularity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bank) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(bank)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32bits) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(padding32bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).instancePtr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestAccessCounterInfo_V2),
            "::",
            stringify!(instancePtr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventTestSplitInvalidateInfo {
    pub eventType: NvU8,
}
#[test]
fn bindgen_test_layout_UvmEventTestSplitInvalidateInfo() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventTestSplitInvalidateInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventTestSplitInvalidateInfo>(),
        1usize,
        concat!("Size of: ", stringify!(UvmEventTestSplitInvalidateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventTestSplitInvalidateInfo>(),
        1usize,
        concat!("Alignment of ", stringify!(UvmEventTestSplitInvalidateInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventTestSplitInvalidateInfo),
            "::",
            stringify!(eventType)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct UvmEventEntry_V1 {
    pub __bindgen_anon_1: UvmEventEntry_V1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union UvmEventEntry_V1__bindgen_ty_1 {
    pub eventData: UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1,
    pub testEventData: UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1 {
    pub eventType: NvU8,
    pub migration_Lite: UvmEventMigrationInfo_Lite,
    pub cpuFault: UvmEventCpuFaultInfo_V1,
    pub migration: UvmEventMigrationInfo_V1,
    pub gpuFault: UvmEventGpuFaultInfo_V1,
    pub gpuFaultReplay: UvmEventGpuFaultReplayInfo_V1,
    pub fatalFault: UvmEventFatalFaultInfo_V1,
    pub readDuplicate: UvmEventReadDuplicateInfo_V1,
    pub readDuplicateInvalidate: UvmEventReadDuplicateInvalidateInfo_V1,
    pub pageSizeChange: UvmEventPageSizeChangeInfo_V1,
    pub thrashing: UvmEventThrashingDetectedInfo_V1,
    pub throttlingStart: UvmEventThrottlingStartInfo_V1,
    pub throttlingEnd: UvmEventThrottlingEndInfo_V1,
    pub mapRemote: UvmEventMapRemoteInfo_V1,
    pub eviction: UvmEventEvictionInfo_V1,
}
#[test]
fn bindgen_test_layout_UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).migration_Lite) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(migration_Lite)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cpuFault) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(cpuFault)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).migration) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(migration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuFault) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(gpuFault)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuFaultReplay) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(gpuFaultReplay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fatalFault) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(fatalFault)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readDuplicate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(readDuplicate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readDuplicateInvalidate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(readDuplicateInvalidate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pageSizeChange) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(pageSizeChange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thrashing) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(thrashing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).throttlingStart) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(throttlingStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).throttlingEnd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(throttlingEnd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapRemote) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(mapRemote)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eviction) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(eviction)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_2 {
    pub eventType: NvU8,
    pub accessCounter: UvmEventTestAccessCounterInfo_V1,
    pub splitInvalidate: UvmEventTestSplitInvalidateInfo,
}
#[test]
fn bindgen_test_layout_UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_2>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accessCounter) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(accessCounter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).splitInvalidate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(splitInvalidate)
        )
    );
}
#[test]
fn bindgen_test_layout_UvmEventEntry_V1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventEntry_V1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventEntry_V1__bindgen_ty_1>(),
        64usize,
        concat!("Size of: ", stringify!(UvmEventEntry_V1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventEntry_V1__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventEntry_V1__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1),
            "::",
            stringify!(eventData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).testEventData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V1__bindgen_ty_1),
            "::",
            stringify!(testEventData)
        )
    );
}
#[test]
fn bindgen_test_layout_UvmEventEntry_V1() {
    assert_eq!(
        ::std::mem::size_of::<UvmEventEntry_V1>(),
        64usize,
        concat!("Size of: ", stringify!(UvmEventEntry_V1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventEntry_V1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventEntry_V1))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct UvmEventEntry_V2 {
    pub __bindgen_anon_1: UvmEventEntry_V2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union UvmEventEntry_V2__bindgen_ty_1 {
    pub eventData: UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1,
    pub testEventData: UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1 {
    pub eventType: NvU8,
    pub migration_Lite: UvmEventMigrationInfo_Lite,
    pub cpuFault: UvmEventCpuFaultInfo_V2,
    pub migration: UvmEventMigrationInfo_V2,
    pub gpuFault: UvmEventGpuFaultInfo_V2,
    pub gpuFaultReplay: UvmEventGpuFaultReplayInfo_V2,
    pub fatalFault: UvmEventFatalFaultInfo_V2,
    pub readDuplicate: UvmEventReadDuplicateInfo_V2,
    pub readDuplicateInvalidate: UvmEventReadDuplicateInvalidateInfo_V2,
    pub pageSizeChange: UvmEventPageSizeChangeInfo_V2,
    pub thrashing: UvmEventThrashingDetectedInfo_V2,
    pub throttlingStart: UvmEventThrottlingStartInfo_V2,
    pub throttlingEnd: UvmEventThrottlingEndInfo_V2,
    pub mapRemote: UvmEventMapRemoteInfo_V2,
    pub eviction: UvmEventEvictionInfo_V2,
}
#[test]
fn bindgen_test_layout_UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1>(),
        72usize,
        concat!(
            "Size of: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).migration_Lite) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(migration_Lite)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cpuFault) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(cpuFault)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).migration) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(migration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuFault) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(gpuFault)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpuFaultReplay) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(gpuFaultReplay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fatalFault) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(fatalFault)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readDuplicate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(readDuplicate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readDuplicateInvalidate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(readDuplicateInvalidate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pageSizeChange) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(pageSizeChange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thrashing) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(thrashing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).throttlingStart) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(throttlingStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).throttlingEnd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(throttlingEnd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mapRemote) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(mapRemote)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eviction) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(eviction)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_2 {
    pub eventType: NvU8,
    pub accessCounter: UvmEventTestAccessCounterInfo_V2,
    pub splitInvalidate: UvmEventTestSplitInvalidateInfo,
}
#[test]
fn bindgen_test_layout_UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_2>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accessCounter) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(accessCounter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).splitInvalidate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(splitInvalidate)
        )
    );
}
#[test]
fn bindgen_test_layout_UvmEventEntry_V2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventEntry_V2__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventEntry_V2__bindgen_ty_1>(),
        72usize,
        concat!("Size of: ", stringify!(UvmEventEntry_V2__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventEntry_V2__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventEntry_V2__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1),
            "::",
            stringify!(eventData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).testEventData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventEntry_V2__bindgen_ty_1),
            "::",
            stringify!(testEventData)
        )
    );
}
#[test]
fn bindgen_test_layout_UvmEventEntry_V2() {
    assert_eq!(
        ::std::mem::size_of::<UvmEventEntry_V2>(),
        72usize,
        concat!("Size of: ", stringify!(UvmEventEntry_V2))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventEntry_V2>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventEntry_V2))
    );
}
pub const UvmEventTimeStampType_UvmEventTimeStampTypeInvalid: UvmEventTimeStampType = 0;
pub const UvmEventTimeStampType_UvmEventTimeStampTypeWin32QPC: UvmEventTimeStampType = 1;
pub const UvmEventTimeStampType_UvmEventTimeStampTypePosixClockGetTime: UvmEventTimeStampType = 2;
pub const UvmEventTimeStampType_UvmEventTimeStampTypeAuto: UvmEventTimeStampType = 3;
pub const UvmEventTimeStampType_UvmEventNumTimeStampTypes: UvmEventTimeStampType = 4;
pub type UvmEventTimeStampType = ::std::os::raw::c_uint;
pub type UvmEventQueueHandle = NvUPtr;
pub const UvmDebugAccessType_UvmDebugAccessTypeRead: UvmDebugAccessType = 0;
pub const UvmDebugAccessType_UvmDebugAccessTypeWrite: UvmDebugAccessType = 1;
pub type UvmDebugAccessType = ::std::os::raw::c_uint;
pub const UvmToolsEventQueueVersion_UvmToolsEventQueueVersion_V1: UvmToolsEventQueueVersion = 1;
pub const UvmToolsEventQueueVersion_UvmToolsEventQueueVersion_V2: UvmToolsEventQueueVersion = 2;
pub type UvmToolsEventQueueVersion = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventControlData_V1_tag {
    pub get_ahead: NvU32,
    pub get_behind: NvU32,
    pub put_ahead: NvU32,
    pub put_behind: NvU32,
    pub dropped: [NvU64; 64usize],
}
#[test]
fn bindgen_test_layout_UvmEventControlData_V1_tag() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventControlData_V1_tag> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventControlData_V1_tag>(),
        528usize,
        concat!("Size of: ", stringify!(UvmEventControlData_V1_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventControlData_V1_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventControlData_V1_tag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_ahead) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventControlData_V1_tag),
            "::",
            stringify!(get_ahead)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_behind) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventControlData_V1_tag),
            "::",
            stringify!(get_behind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).put_ahead) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventControlData_V1_tag),
            "::",
            stringify!(put_ahead)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).put_behind) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventControlData_V1_tag),
            "::",
            stringify!(put_behind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dropped) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventControlData_V1_tag),
            "::",
            stringify!(dropped)
        )
    );
}
pub type UvmToolsEventControlData_V1 = UvmEventControlData_V1_tag;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmEventControlData_V2_tag {
    pub get_ahead: NvU32,
    pub get_behind: NvU32,
    pub put_ahead: NvU32,
    pub put_behind: NvU32,
    pub version: NvU32,
    pub padding32Bits: NvU32,
    pub dropped: [NvU64; 64usize],
}
#[test]
fn bindgen_test_layout_UvmEventControlData_V2_tag() {
    const UNINIT: ::std::mem::MaybeUninit<UvmEventControlData_V2_tag> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UvmEventControlData_V2_tag>(),
        536usize,
        concat!("Size of: ", stringify!(UvmEventControlData_V2_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<UvmEventControlData_V2_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(UvmEventControlData_V2_tag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_ahead) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventControlData_V2_tag),
            "::",
            stringify!(get_ahead)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_behind) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventControlData_V2_tag),
            "::",
            stringify!(get_behind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).put_ahead) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventControlData_V2_tag),
            "::",
            stringify!(put_ahead)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).put_behind) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventControlData_V2_tag),
            "::",
            stringify!(put_behind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventControlData_V2_tag),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding32Bits) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventControlData_V2_tag),
            "::",
            stringify!(padding32Bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dropped) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UvmEventControlData_V2_tag),
            "::",
            stringify!(dropped)
        )
    );
}
pub type UvmToolsEventControlData_V2 = UvmEventControlData_V2_tag;
pub type UvmToolsEventControlData = UvmToolsEventControlData_V1;
pub type UvmEventEntry = UvmEventEntry_V1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmToolsSession_tag {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmToolsEventQueue_tag {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UvmToolsCounters_tag {
    _unused: [u8; 0],
}
pub type UvmToolsSession = UvmToolsSession_tag;
pub type UvmToolsEventQueue = UvmToolsEventQueue_tag;
pub type UvmToolsCounters = UvmToolsCounters_tag;
pub type UvmToolsSessionHandle = *mut UvmToolsSession;
pub type UvmToolsEventQueueHandle = *mut UvmToolsEventQueue;
pub type UvmToolsCountersHandle = *mut UvmToolsCounters;
